In [1]:
import pandas as pd

In [2]:
startup_failures = pd.read_csv(r"C:\Users\Atefah\Desktop\IRONHACK\SQL_PROJECT\DATA_SET\Startup Failures.csv")

In [3]:
startup_failures.head(2)

        Name        Sector Years of Operation
0  99dresses  Retail Trade      3 (2010-2013)
1    Ahalife  Retail Trade      7 (2010-2017)

In [4]:
startup_failures.rename(columns={
    'Name': 'name',
    'Sector': 'sector',
    'Years of Operation': 'years_operation'
}, inplace=True)

print(startup_failures.columns)

Index(['name', 'sector', 'years_operation'], dtype='object')

In [5]:
startup_failures[['start_year','end_year']] = startup_failures['years_operation'].str.split('-', expand=True)

In [6]:
startup_failures.head(2)

        name        sector years_operation start_year end_year
0  99dresses  Retail Trade   3 (2010-2013)    3 (2010    2013)
1    Ahalife  Retail Trade   7 (2010-2017)    7 (2010    2017)

In [7]:
startup_failures['start_year_cleaned'] = startup_failures['start_year'].str.extract(r'\((\d{4})')

In [8]:
startup_failures.head(2)

,name,sector,years_operation,start_year,end_year,start_year_cleaned
0,99dresses,Retail Trade,3 (2010-2013),3 (2010,2013),2010
1,Ahalife,Retail Trade,7 (2010-2017),7 (2010,2017),2010

In [9]:
startup_failures.drop(columns=['start_year'], inplace=True)

In [10]:
startup_failures.head(2)

        name        sector years_operation end_year start_year_cleaned
0  99dresses  Retail Trade   3 (2010-2013)    2013)               2010
1    Ahalife  Retail Trade   7 (2010-2017)    2017)               2010

In [11]:
startup_failures.rename(columns={
    'start_year_cleaned': 'start_year'}, inplace=True)

In [12]:
startup_failures.head(2)

        name        sector years_operation end_year start_year
0  99dresses  Retail Trade   3 (2010-2013)    2013)       2010
1    Ahalife  Retail Trade   7 (2010-2017)    2017)       2010

In [14]:
startup_failures['end_year_cleaned'] = startup_failures['end_year'].str.replace(r'[^\d]', '', regex=True)

In [15]:
startup_failures.head(2)

,name,sector,years_operation,end_year,start_year,end_year_cleaned
0,99dresses,Retail Trade,3 (2010-2013),2013),2010,2013
1,Ahalife,Retail Trade,7 (2010-2017),2017),2010,2017

In [16]:
startup_failures.drop(columns=['end_year'], inplace=True)

In [17]:
startup_failures.head(2)

        name        sector years_operation start_year end_year_cleaned
0  99dresses  Retail Trade   3 (2010-2013)       2010             2013
1    Ahalife  Retail Trade   7 (2010-2017)       2010             2017

In [18]:
startup_failures.rename(columns={
    'end_year_cleaned': 'end_year'}, inplace=True)

In [19]:
startup_failures.head(2)

        name        sector years_operation start_year end_year
0  99dresses  Retail Trade   3 (2010-2013)       2010     2013
1    Ahalife  Retail Trade   7 (2010-2017)       2010     2017

In [20]:
startup_failures['years_operation_cleaned'] = startup_failures['years_operation'].str.replace(r'\s*\(.*\)', '', regex=True)

In [21]:
startup_failures.head(2)

,name,sector,years_operation,start_year,end_year,years_operation_cleaned
0,99dresses,Retail Trade,3 (2010-2013),2010,2013,3
1,Ahalife,Retail Trade,7 (2010-2017),2010,2017,7

In [22]:
startup_failures.drop(columns=['years_operation'], inplace=True)

In [23]:
startup_failures.rename(columns={
    'years_opeartion_cleaned': 'years_operation'}, inplace=True)

In [24]:
startup_failures.head(2)

        name        sector start_year end_year years_operation_cleaned
0  99dresses  Retail Trade       2010     2013                       3
1    Ahalife  Retail Trade       2010     2017                       7

In [25]:
startup_failures.to_csv('startup_failures.csv', index=False)
print("DataFrame saved to 'startup_failures.csv'")

DataFrame saved to 'startup_failures.csv'